MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32L061NT/mcu.h
#define  CRS_CFGR_SYNCDIV                     ((uint32_t)0x07000000)    /*!< SYNC divider */
#define  CRS_CFGR_SYNCDIV_0                   ((uint32_t)0x01000000)    /*!< Bit 0 */
#define  CRS_CFGR_SYNCDIV_1                   ((uint32_t)0x02000000)    /*!< Bit 1 */
#define  CRS_CFGR_SYNCDIV_2                   ((uint32_t)0x04000000)    /*!< Bit 2 */

/*!< SYNCDIV configuration */
#define  CRS_CFGR_SYNCDIV_DIV1                ((uint32_t)0x00000000)        /*!< SYNC not divided */
#define  CRS_CFGR_SYNCDIV_DIV2                ((uint32_t)0x01000000)        /*!< SYNC divided by 2*/
#define  CRS_CFGR_SYNCDIV_DIV4                ((uint32_t)0x02000000)        /*!< SYNC divided by 4*/
#define  CRS_CFGR_SYNCDIV_DIV8                ((uint32_t)0x03000000)        /*!< SYNC divided by 8*/
#define  CRS_CFGR_SYNCDIV_DIV16               ((uint32_t)0x04000000)        /*!< SYNC divided by 18*/
#define  CRS_CFGR_SYNCDIV_DIV32               ((uint32_t)0x05000000)        /*!< SYNC divided by 32*/
#define  CRS_CFGR_SYNCDIV_DIV64               ((uint32_t)0x06000000)        /*!< SYNC divided by 64*/
#define  CRS_CFGR_SYNCDIV_DIV128              ((uint32_t)0x07000000)        /*!< SYNC divided by 128*/

#define  CRS_CFGR_SYNCSRC                     ((uint32_t)0x30000000)        /*!< SYNC signal source selection */
#define  CRS_CFGR_SYNCSRC_0                   ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  CRS_CFGR_SYNCSRC_1                   ((uint32_t)0x20000000)        /*!< Bit 1 */

/*!< SYNCSRC configuration */
#define  CRS_CFGR_SYNCSRC_GPIO                ((uint32_t)0x00000000)        /*!< GPIO Selected as SYNC signal source */
#define  CRS_CFGR_SYNCSRC_LSE                 ((uint32_t)0x10000000)        /*!< LSE Selected as SYNC signal source */
#define  CRS_CFGR_SYNCSRC_USB_SOF             ((uint32_t)0x20000000)        /*!< USB_SOF Selected as SYNC signal source */

#define  CRS_CFGR_SYNCPOL                     ((uint32_t)0x80000000)        /*!< SYNC polarity selection */


/*******************  Bit definition for CRS_ISR register  *******************/
#define  CRS_ISR_SYNCOKF                      ((uint32_t)0x00000001)        /*!< SYNC event OK flag */
#define  CRS_ISR_SYNCWARNF                    ((uint32_t)0x00000002)        /*!< SYNC warning flag */
#define  CRS_ISR_ERRF                         ((uint32_t)0x00000004)        /*!< Error flag */
#define  CRS_ISR_ESYNCF                       ((uint32_t)0x00000008)        /*!< Expected SYNC flag */

#define  CRS_ISR_SYNCERR                      ((uint32_t)0x00000100)        /*!< SYNC error */
#define  CRS_ISR_SYNCMISS                     ((uint32_t)0x00000200)        /*!< SYNC missed */
#define  CRS_ISR_TRIMOVF                      ((uint32_t)0x00000400)        /*!< Trimming overflow or underflow */

#define  CRS_ISR_FEDIR                        ((uint32_t)0x00008000)        /*!< Frequency error direction */

#define  CRS_ISR_FECAP                        ((uint32_t)0xFFFF0000)        /*!< Frequency error capture */

/*******************  Bit definition for CRS_ICR register  *******************/
#define  CRS_ICR_SYNCOKC                      ((uint32_t)0x00000001)        /*!< SYNC event OK clear flag */
#define  CRS_ICR_SYNCWARNC                    ((uint32_t)0x00000002)        /*!< SYNC warning clear flag */
#define  CRS_ICR_ERRC                         ((uint32_t)0x00000004)        /*!< Error clear flag */
#define  CRS_ICR_ESYNCC                       ((uint32_t)0x00000008)        /*!< Expected SYNC clear flag */

/******************************************************************************/
/*                                                                            */
/*                General Purpose and Alternate Function IO                   */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for GPIO_CRL register  *******************/
#define  GPIO_CRL_MODE                       ((uint32_t)0x33333333)        /*!< Port x mode bits */

#define  GPIO_CRL_MODE0                      ((uint32_t)0x00000003)        /*!< MODE0[1:0] bits (Port x mode bits, pin 0) */
#define  GPIO_CRL_MODE0_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  GPIO_CRL_MODE0_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */

#define  GPIO_CRL_MODE1                      ((uint32_t)0x00000030)        /*!< MODE1[1:0] bits (Port x mode bits, pin 1) */
#define  GPIO_CRL_MODE1_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  GPIO_CRL_MODE1_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  GPIO_CRL_MODE2                      ((uint32_t)0x00000300)        /*!< MODE2[1:0] bits (Port x mode bits, pin 2) */
#define  GPIO_CRL_MODE2_0                    ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  GPIO_CRL_MODE2_1                    ((uint32_t)0x00000200)        /*!< Bit 1 */

#define  GPIO_CRL_MODE3                      ((uint32_t)0x00003000)        /*!< MODE3[1:0] bits (Port x mode bits, pin 3) */
#define  GPIO_CRL_MODE3_0                    ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  GPIO_CRL_MODE3_1                    ((uint32_t)0x00002000)        /*!< Bit 1 */

#define  GPIO_CRL_MODE4                      ((uint32_t)0x00030000)        /*!< MODE4[1:0] bits (Port x mode bits, pin 4) */
#define  GPIO_CRL_MODE4_0                    ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  GPIO_CRL_MODE4_1                    ((uint32_t)0x00020000)        /*!< Bit 1 */

#define  GPIO_CRL_MODE5                      ((uint32_t)0x00300000)        /*!< MODE5[1:0] bits (Port x mode bits, pin 5) */
#define  GPIO_CRL_MODE5_0                    ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  GPIO_CRL_MODE5_1                    ((uint32_t)0x00200000)        /*!< Bit 1 */

#define  GPIO_CRL_MODE6                      ((uint32_t)0x03000000)        /*!< MODE6[1:0] bits (Port x mode bits, pin 6) */
#define  GPIO_CRL_MODE6_0                    ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  GPIO_CRL_MODE6_1                    ((uint32_t)0x02000000)        /*!< Bit 1 */

#define  GPIO_CRL_MODE7                      ((uint32_t)0x30000000)        /*!< MODE7[1:0] bits (Port x mode bits, pin 7) */
#define  GPIO_CRL_MODE7_0                    ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  GPIO_CRL_MODE7_1                    ((uint32_t)0x20000000)        /*!< Bit 1 */

#define  GPIO_CRL_CNF                        ((uint32_t)0xCCCCCCCC)        /*!< Port x configuration bits */

#define  GPIO_CRL_CNF0                       ((uint32_t)0x0000000C)        /*!< CNF0[1:0] bits (Port x configuration bits, pin 0) */
#define  GPIO_CRL_CNF0_0                     ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  GPIO_CRL_CNF0_1                     ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  GPIO_CRL_CNF1                       ((uint32_t)0x000000C0)        /*!< CNF1[1:0] bits (Port x configuration bits, pin 1) */
#define  GPIO_CRL_CNF1_0                     ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  GPIO_CRL_CNF1_1                     ((uint32_t)0x00000080)        /*!< Bit 1 */

#define  GPIO_CRL_CNF2                       ((uint32_t)0x00000C00)        /*!< CNF2[1:0] bits (Port x configuration bits, pin 2) */
#define  GPIO_CRL_CNF2_0                     ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  GPIO_CRL_CNF2_1                     ((uint32_t)0x00000800)        /*!< Bit 1 */

#define  GPIO_CRL_CNF3                       ((uint32_t)0x0000C000)        /*!< CNF3[1:0] bits (Port x configuration bits, pin 3) */
#define  GPIO_CRL_CNF3_0                     ((uint32_t)0x00004000)        /*!< Bit 0 */
#define  GPIO_CRL_CNF3_1                     ((uint32_t)0x00008000)        /*!< Bit 1 */

#define  GPIO_CRL_CNF4                       ((uint32_t)0x000C0000)        /*!< CNF4[1:0] bits (Port x configuration bits, pin 4) */
#define  GPIO_CRL_CNF4_0                     ((uint32_t)0x00040000)        /*!< Bit 0 */
#define  GPIO_CRL_CNF4_1                     ((uint32_t)0x00080000)        /*!< Bit 1 */

#define  GPIO_CRL_CNF5                       ((uint32_t)0x00C00000)        /*!< CNF5[1:0] bits (Port x configuration bits, pin 5) */
#define  GPIO_CRL_CNF5_0                     ((uint32_t)0x00400000)        /*!< Bit 0 */
#define  GPIO_CRL_CNF5_1                     ((uint32_t)0x00800000)        /*!< Bit 1 */

#define  GPIO_CRL_CNF6                       ((uint32_t)0x0C000000)        /*!< CNF6[1:0] bits (Port x configuration bits, pin 6) */
#define  GPIO_CRL_CNF6_0                     ((uint32_t)0x04000000)        /*!< Bit 0 */
#define  GPIO_CRL_CNF6_1                     ((uint32_t)0x08000000)        /*!< Bit 1 */

#define  GPIO_CRL_CNF7                       ((uint32_t)0xC0000000)        /*!< CNF7[1:0] bits (Port x configuration bits, pin 7) */
#define  GPIO_CRL_CNF7_0                     ((uint32_t)0x40000000)        /*!< Bit 0 */
#define  GPIO_CRL_CNF7_1                     ((uint32_t)0x80000000)        /*!< Bit 1 */

