MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32L061NT/mcu.h
#define  CAN_BASIC_TXID1_ID                        ((uint16_t)0x00E0)
#define  CAN_BASIC_TXID1_ID_0                      ((uint16_t)0x0020)
#define  CAN_BASIC_TXID1_ID_1                      ((uint16_t)0x0040)
#define  CAN_BASIC_TXID1_ID_2                      ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BASIC_TXDR0 register  *******************/
#define  CAN_BASIC_TXDR0                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_TXDR1 register  *******************/
#define  CAN_BASIC_TXDR1                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_TXDR2 register  *******************/
#define  CAN_BASIC_TXDR2                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_TXDR3 register  *******************/
#define  CAN_BASIC_TXDR3                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_TXDR4 register  *******************/
#define  CAN_BASIC_TXDR4                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_TXDR5 register  *******************/
#define  CAN_BASIC_TXDR5                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_TXDR6 register  *******************/
#define  CAN_BASIC_TXDR6                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_TXDR7 register  *******************/
#define  CAN_BASIC_TXDR7                           ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_BASIC_RXID0 register  *******************/
#define  CAN_BASIC_RXID0_ID                        ((uint16_t)0x00FF)
#define  CAN_BASIC_RXID0_ID_3                      ((uint16_t)0x0001)
#define  CAN_BASIC_RXID0_ID_4                      ((uint16_t)0x0002)
#define  CAN_BASIC_RXID0_ID_5                      ((uint16_t)0x0004)
#define  CAN_BASIC_RXID0_ID_6                      ((uint16_t)0x0008)
#define  CAN_BASIC_RXID0_ID_7                      ((uint16_t)0x0010)
#define  CAN_BASIC_RXID0_ID_8                      ((uint16_t)0x0020)
#define  CAN_BASIC_RXID0_ID_9                      ((uint16_t)0x0040)
#define  CAN_BASIC_RXID0_ID_10                     ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BASIC_RXID1 register  *******************/
#define  CAN_BASIC_RXID1_RTR                       ((uint16_t)0x0010)
#define  CAN_BASIC_RXID1_DLC                       ((uint16_t)0x000F)
#define  CAN_BASIC_RXID1_DLC_0                     ((uint16_t)0x0001)
#define  CAN_BASIC_RXID1_DLC_1                     ((uint16_t)0x0002)
#define  CAN_BASIC_RXID1_DLC_2                     ((uint16_t)0x0004)
#define  CAN_BASIC_RXID1_DLC_3                     ((uint16_t)0x0008)

#define  CAN_BASIC_RXID1_ID                        ((uint16_t)0x00E0)
#define  CAN_BASIC_RXID1_ID_0                      ((uint16_t)0x0020)
#define  CAN_BASIC_RXID1_ID_1                      ((uint16_t)0x0040)
#define  CAN_BASIC_RXID1_ID_2                      ((uint16_t)0x0080)

/*******************  Bit definition for CAN_BASIC_RXDR0 register  *******************/
#define  CAN_BASIC_RXDR0                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_RXDR1 register  *******************/
#define  CAN_BASIC_RXDR1                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_RXDR2 register  *******************/
#define  CAN_BASIC_RXDR2                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_RXDR3 register  *******************/
#define  CAN_BASIC_RXDR3                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_RXDR4 register  *******************/
#define  CAN_BASIC_RXDR4                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_RXDR5 register  *******************/
#define  CAN_BASIC_RXDR5                           ((uint16_t)0x00FF)
/*******************  0.Bit definition for CAN_BASIC_RXDR6 register  *******************/
#define  CAN_BASIC_RXDR6                           ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_BASIC_RXDR7 register  *******************/
#define  CAN_BASIC_RXDR7                           ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_BASIC_CDR register  *******************/
#define  CAN_BASIC_CDR_MODE                        ((uint16_t)0x0080)


/*!<PeliCAN registers */

/*******************  Bit definition for CAN_PELI_MOD register  *******************/
#define  CAN_PELI_MOD_RM                             ((uint16_t)0x0001)
#define  CAN_PELI_MOD_LOM                            ((uint16_t)0x0002)
#define  CAN_PELI_MOD_STM                            ((uint16_t)0x0004)
#define  CAN_PELI_MOD_AFM                            ((uint16_t)0x0008)
#define  CAN_PELI_MOD_SM                             ((uint16_t)0x0010)

/*******************  Bit definition for CAN_PELI_CMR register  *******************/
#define  CAN_PELI_CMR_TR                             ((uint16_t)0x0001)
#define  CAN_PELI_CMR_AT                             ((uint16_t)0x0002)
#define  CAN_PELI_CMR_RRB                            ((uint16_t)0x0004)
#define  CAN_PELI_CMR_CDO                            ((uint16_t)0x0008)
#define  CAN_PELI_CMR_SRR                            ((uint16_t)0x0010)

/*******************  Bit definition for CAN_PELI_SR register  *******************/
#define  CAN_PELI_SR_RBS                             ((uint16_t)0x0001)
#define  CAN_PELI_SR_DOS                             ((uint16_t)0x0002)
#define  CAN_PELI_SR_TBS                             ((uint16_t)0x0004)
#define  CAN_PELI_SR_TCS                             ((uint16_t)0x0008)
#define  CAN_PELI_SR_RS                              ((uint16_t)0x0010)
#define  CAN_PELI_SR_TS                              ((uint16_t)0x0020)
#define  CAN_PELI_SR_ES                              ((uint16_t)0x0040)
#define  CAN_PELI_SR_BS                              ((uint16_t)0x0080)

