MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32L061NT/mcu.h
#define  CAN_PELI_ACR0_AC_SDID21                   ((uint16_t)0x0001)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID21*/
#define  CAN_PELI_ACR0_AC_SDID22                   ((uint16_t)0x0002)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID22*/
#define  CAN_PELI_ACR0_AC_SDID23                   ((uint16_t)0x0004)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID23*/
#define  CAN_PELI_ACR0_AC_SDID24                   ((uint16_t)0x0008)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID24*/
#define  CAN_PELI_ACR0_AC_SDID25                   ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID25*/
#define  CAN_PELI_ACR0_AC_SDID26                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID26*/
#define  CAN_PELI_ACR0_AC_SDID27                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID27*/
#define  CAN_PELI_ACR0_AC_SDID28                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID28*/

#define  CAN_PELI_ACR0_AC_EDID21                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID21*/
#define  CAN_PELI_ACR0_AC_EDID22                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID22*/
#define  CAN_PELI_ACR0_AC_EDID23                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID23*/
#define  CAN_PELI_ACR0_AC_EDID24                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID24*/
#define  CAN_PELI_ACR0_AC_EDID25                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID25*/
#define  CAN_PELI_ACR0_AC_EDID26                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID26*/
#define  CAN_PELI_ACR0_AC_EDID27                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID27*/
#define  CAN_PELI_ACR0_AC_EDID28                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID28*/

/*******************  Bit definition for CAN_PELI_ACR1 register  *******************/
#define  CAN_PELI_ACR1_AC                          ((uint16_t)0x00FF)
#define  CAN_PELI_ACR1_AC_0                        ((uint16_t)0x0001)
#define  CAN_PELI_ACR1_AC_1                        ((uint16_t)0x0002)
#define  CAN_PELI_ACR1_AC_2                        ((uint16_t)0x0004)
#define  CAN_PELI_ACR1_AC_3                        ((uint16_t)0x0008)
#define  CAN_PELI_ACR1_AC_4                        ((uint16_t)0x0010)
#define  CAN_PELI_ACR1_AC_5                        ((uint16_t)0x0020)
#define  CAN_PELI_ACR1_AC_6                        ((uint16_t)0x0040)
#define  CAN_PELI_ACR1_AC_7                        ((uint16_t)0x0080)

#define  CAN_PELI_ACR1_AC_SSRTR                    ((uint16_t)0x0010)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG RTR*/
#define  CAN_PELI_ACR1_AC_SSID18                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID18*/
#define  CAN_PELI_ACR1_AC_SSID19                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID19*/
#define  CAN_PELI_ACR1_AC_SSID20                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID20*/

#define  CAN_PELI_ACR1_AC_ESID13                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID13*/
#define  CAN_PELI_ACR1_AC_ESID14                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID14*/
#define  CAN_PELI_ACR1_AC_ESID15                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID15*/
#define  CAN_PELI_ACR1_AC_ESID16                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID16*/
#define  CAN_PELI_ACR1_AC_ESID17                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID17*/
#define  CAN_PELI_ACR1_AC_ESID18                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID18*/
#define  CAN_PELI_ACR1_AC_ESID19                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID19*/
#define  CAN_PELI_ACR1_AC_ESID20                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID20*/


#define  CAN_PELI_ACR1_AC_SDDATA0_4                ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 4*/
#define  CAN_PELI_ACR1_AC_SDDATA0_5                ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 5*/
#define  CAN_PELI_ACR1_AC_SDDATA0_6                ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 6*/
#define  CAN_PELI_ACR1_AC_SDDATA0_7                ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 7*/
#define  CAN_PELI_ACR1_AC_SDRTR                    ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG RTR */
#define  CAN_PELI_ACR1_AC_SDID18                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID18*/
#define  CAN_PELI_ACR1_AC_SDID19                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID19*/
#define  CAN_PELI_ACR1_AC_SDID20                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID20*/

#define  CAN_PELI_ACR1_AC_EDID13                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID13*/
#define  CAN_PELI_ACR1_AC_EDID14                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID14*/
#define  CAN_PELI_ACR1_AC_EDID15                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID15*/
#define  CAN_PELI_ACR1_AC_EDID16                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID16*/
#define  CAN_PELI_ACR1_AC_EDID17                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID17*/
#define  CAN_PELI_ACR1_AC_EDID18                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID18*/
#define  CAN_PELI_ACR1_AC_EDID19                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID19*/
#define  CAN_PELI_ACR1_AC_EDID20                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID20*/


