MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32L061NT/mcu.h
#define  CAN_PELI_ACR3_AC_SDDATA0_0                ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 0*/
#define  CAN_PELI_ACR3_AC_SDDATA0_1                ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 1*/
#define  CAN_PELI_ACR3_AC_SDDATA0_2                ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 2*/
#define  CAN_PELI_ACR3_AC_SDDATA0_3                ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 3*/
#define  CAN_PELI_ACR3_AC_SDRTR                    ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG RTR*/
#define  CAN_PELI_ACR3_AC_SDID18                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID18*/
#define  CAN_PELI_ACR3_AC_SDID19                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID19*/
#define  CAN_PELI_ACR3_AC_SDID20                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID20*/

#define  CAN_PELI_ACR3_AC_EDID13                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID13*/
#define  CAN_PELI_ACR3_AC_EDID14                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID14*/
#define  CAN_PELI_ACR3_AC_EDID15                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID15*/
#define  CAN_PELI_ACR3_AC_EDID16                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID16*/
#define  CAN_PELI_ACR3_AC_EDID17                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID17*/
#define  CAN_PELI_ACR3_AC_EDID18                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID18*/
#define  CAN_PELI_ACR3_AC_EDID19                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID19*/
#define  CAN_PELI_ACR3_AC_EDID20                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID20*/

/*******************  Bit definition for CAN_PELI_AMR0 register  *******************/
#define  CAN_PELI_AMR0_AM                          ((uint16_t)0x00FF)
#define  CAN_PELI_AMR0_AM_0                        ((uint16_t)0x0001)
#define  CAN_PELI_AMR0_AM_1                        ((uint16_t)0x0002)
#define  CAN_PELI_AMR0_AM_2                        ((uint16_t)0x0004)
#define  CAN_PELI_AMR0_AM_3                        ((uint16_t)0x0008)
#define  CAN_PELI_AMR0_AM_4                        ((uint16_t)0x0010)
#define  CAN_PELI_AMR0_AM_5                        ((uint16_t)0x0020)
#define  CAN_PELI_AMR0_AM_6                        ((uint16_t)0x0040)
#define  CAN_PELI_AMR0_AM_7                        ((uint16_t)0x0080)

#define  CAN_PELI_AMR0_AM_SSID21                   ((uint16_t)0x0001)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID21*/
#define  CAN_PELI_AMR0_AM_SSID22                   ((uint16_t)0x0002)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID22*/
#define  CAN_PELI_AMR0_AM_SSID23                   ((uint16_t)0x0004)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID23*/
#define  CAN_PELI_AMR0_AM_SSID24                   ((uint16_t)0x0008)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID24*/
#define  CAN_PELI_AMR0_AM_SSID25                   ((uint16_t)0x0010)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID25*/
#define  CAN_PELI_AMR0_AM_SSID26                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID26*/
#define  CAN_PELI_AMR0_AM_SSID27                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID27*/
#define  CAN_PELI_AMR0_AM_SSID28                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID28*/

#define  CAN_PELI_AMR0_AM_ESID21                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID21*/
#define  CAN_PELI_AMR0_AM_ESID22                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID22*/
#define  CAN_PELI_AMR0_AM_ESID23                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID23*/
#define  CAN_PELI_AMR0_AM_ESID24                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID24*/
#define  CAN_PELI_AMR0_AM_ESID25                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID25*/
#define  CAN_PELI_AMR0_AM_ESID26                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID26*/
#define  CAN_PELI_AMR0_AM_ESID27                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID27*/
#define  CAN_PELI_AMR0_AM_ESID28                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID28*/

#define  CAN_PELI_AMR0_AM_SDID21                   ((uint16_t)0x0001)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID21*/
#define  CAN_PELI_AMR0_AM_SDID22                   ((uint16_t)0x0002)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID22*/
#define  CAN_PELI_AMR0_AM_SDID23                   ((uint16_t)0x0004)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID23*/
#define  CAN_PELI_AMR0_AM_SDID24                   ((uint16_t)0x0008)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID24*/
#define  CAN_PELI_AMR0_AM_SDID25                   ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID25*/
#define  CAN_PELI_AMR0_AM_SDID26                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID26*/
#define  CAN_PELI_AMR0_AM_SDID27                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID27*/
#define  CAN_PELI_AMR0_AM_SDID28                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID28*/

#define  CAN_PELI_AMR0_AM_EDID21                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID21*/
#define  CAN_PELI_AMR0_AM_EDID22                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID22*/
#define  CAN_PELI_AMR0_AM_EDID23                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID23*/
#define  CAN_PELI_AMR0_AM_EDID24                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID24*/
#define  CAN_PELI_AMR0_AM_EDID25                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID25*/
#define  CAN_PELI_AMR0_AM_EDID26                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID26*/
#define  CAN_PELI_AMR0_AM_EDID27                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID27*/
#define  CAN_PELI_AMR0_AM_EDID28                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID28*/

/*******************  Bit definition for CAN_PELI_AMR1 register  *******************/
#define  CAN_PELI_AMR1_AM                          ((uint16_t)0x00FF)
#define  CAN_PELI_AMR1_AM_0                        ((uint16_t)0x0001)
#define  CAN_PELI_AMR1_AM_1                        ((uint16_t)0x0002)
#define  CAN_PELI_AMR1_AM_2                        ((uint16_t)0x0004)
#define  CAN_PELI_AMR1_AM_3                        ((uint16_t)0x0008)
#define  CAN_PELI_AMR1_AM_4                        ((uint16_t)0x0010)
#define  CAN_PELI_AMR1_AM_5                        ((uint16_t)0x0020)
#define  CAN_PELI_AMR1_AM_6                        ((uint16_t)0x0040)
#define  CAN_PELI_AMR1_AM_7                        ((uint16_t)0x0080)

#define  CAN_PELI_AMR1_AM_SSRTR                    ((uint16_t)0x0010)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG RTR*/
#define  CAN_PELI_AMR1_AM_SSID18                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID18*/
#define  CAN_PELI_AMR1_AM_SSID19                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID19*/
#define  CAN_PELI_AMR1_AM_SSID20                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID20*/

#define  CAN_PELI_AMR1_AM_ESID13                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID13*/
#define  CAN_PELI_AMR1_AM_ESID14                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID14*/
#define  CAN_PELI_AMR1_AM_ESID15                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID15*/
#define  CAN_PELI_AMR1_AM_ESID16                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID16*/
#define  CAN_PELI_AMR1_AM_ESID17                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID17*/
#define  CAN_PELI_AMR1_AM_ESID18                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID18*/
#define  CAN_PELI_AMR1_AM_ESID19                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID19*/
#define  CAN_PELI_AMR1_AM_ESID20                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID20*/


#define  CAN_PELI_AMR1_AM_SDDATA0_4                ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 4*/
#define  CAN_PELI_AMR1_AM_SDDATA0_5                ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 5*/
#define  CAN_PELI_AMR1_AM_SDDATA0_6                ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 6*/
#define  CAN_PELI_AMR1_AM_SDDATA0_7                ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 7*/
#define  CAN_PELI_AMR1_AM_SDRTR                    ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG RTR */
#define  CAN_PELI_AMR1_AM_SDID18                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID18*/
#define  CAN_PELI_AMR1_AM_SDID19                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID19*/
#define  CAN_PELI_AMR1_AM_SDID20                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID20*/

